gibic-leici/ADS1299/Ports/STM32/ads1299lib_STM32F407.c
/**
 * @file ads1299lib_STM32.c
 * @brief STM32-specific hardware interface for the ADS1299 library
 *
 * Implements SPI, DMA, GPIO and interrupt glue code used by the core
 * ADS1299 driver. Designed for STM32F4xx using the LL drivers and CMSIS-RTOS.
 *
 * @author Marcelo Haberman <marcelo.haberman@gmail.com>,
 *         marcelo.haberman@ing.unlp.edu.ar - GIBIC (gibic.ar)
 * @date 2026-02-05
 */

#include "ads1299lib_STM32F407.h"
#include "ads1299lib.h"
#include "ads1299lib_interface.h"
// LL includes removed
#include <assert.h>

/**
 * @brief Enable GPIO Clock
 */
static void enable_gpio_clock(GPIO_TypeDef *port) {
  if (port == GPIOA)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
  else if (port == GPIOB)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
  else if (port == GPIOC)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
  else if (port == GPIOD)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
  else if (port == GPIOE)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
  else if (port == GPIOF)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;
  else if (port == GPIOG)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
  else if (port == GPIOH)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
  else if (port == GPIOI)
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
}

/**
 * @brief Configure GPIO Pin
 */
static void config_gpio_pin(GPIO_TypeDef *port, uint32_t pin_mask,
                            uint32_t mode, uint32_t type, uint32_t speed,
                            uint32_t pull, uint32_t af) {
  for (uint32_t pin_pos = 0; pin_pos < 16; pin_pos++) {
    if (!(pin_mask & (1U << pin_pos)))
      continue;

    // Mode
    port->MODER &= ~(3U << (pin_pos * 2));
    port->MODER |= (mode << (pin_pos * 2));

    // Type
    port->OTYPER &= ~(1U << pin_pos);
    port->OTYPER |= (type << pin_pos);

    // Speed
    port->OSPEEDR &= ~(3U << (pin_pos * 2));
    port->OSPEEDR |= (speed << (pin_pos * 2));

    // Pull
    port->PUPDR &= ~(3U << (pin_pos * 2));
    port->PUPDR |= (pull << (pin_pos * 2));

    // AF
    if (mode == 2) { // AF Mode
      if (pin_pos < 8) {
        port->AFR[0] &= ~(0xF << (pin_pos * 4));
        port->AFR[0] |= (af << (pin_pos * 4));
      } else {
        port->AFR[1] &= ~(0xF << ((pin_pos - 8) * 4));
        port->AFR[1] |= (af << ((pin_pos - 8) * 4));
      }
    }
  }
}

/**
 * @brief Perform a delay using the hardware interface handler
 *
 * @param self Pointer to ads_t structure
 * @param millis Delay duration in milliseconds
 */
void ads_interface_delay(ads_t *self, uint16_t millis) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);

  interface->delay(millis);
}

/**
 * @brief Perform hardware reset of ADS1299 via RESET/PWDN pin
 *
 * Toggles the RESET pin low then high to perform a complete hardware reset.
 * This resets all internal registers to their default values and
 * re-initializes the serial interface state machine.
 *
 * @param self Pointer to ads_t structure
 *
 * @note Duration: ~1.1 seconds (100ms low + 1000ms high)
 */
void ads_interface_hard_reset(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);

  interface->prst_port->BSRR = (interface->prst_pin << 16); // Reset Low
  interface->delay(100);
  interface->prst_port->BSRR = interface->prst_pin; // Reset High
  interface->delay(1000);
}

/**
 * @brief Initialize GPIO pins for ADS1299 communication
 *
 * Configures the CS (Chip Select), RESET/PWDN, and DRDY pins as required
 * for the ADS1299 interface. CS and RESET pins are set as push-pull outputs,
 * and DRDY pin is configured based on interrupt mode.
 *
 * @param interface Pointer to STM32_interface_handler_t structure
 */
static void init_gpios(STM32_interface_handler_t *interface) {
  assert(interface != NULL);
  assert(interface->cs_port != NULL);
  assert(interface->prst_port != NULL);
  assert(interface->drdy_port != NULL);

  // Enable GPIO port clocks
  if (interface->cs_port != NULL)
    enable_gpio_clock(interface->cs_port);
  if (interface->drdy_port != NULL)
    enable_gpio_clock(interface->drdy_port);
  if (interface->prst_port != NULL)
    enable_gpio_clock(interface->prst_port);

  // Configure CS pin as output (push-pull, no pull, High Speed)
  // Output, PushPull, HighSpeed, NoPull, NoAF
  config_gpio_pin(interface->cs_port, interface->cs_pin, 1, 0, 3, 0, 0);
  interface->cs_port->BSRR = interface->cs_pin; // Set High (Inactive)

  // Configure RESET/PWDN pin as output (push-pull, no pull, High Speed)
  config_gpio_pin(interface->prst_port, interface->prst_pin, 1, 0, 3, 0, 0);
  interface->prst_port->BSRR = interface->prst_pin; // Set High (Inactive)

  // Configure DRDY pin as input for data ready interrupt/polling with Pull-up
  // Input(0), PushPull(0), HighSpeed(0), PullUp(1), NoAF
  config_gpio_pin(interface->drdy_port, interface->drdy_pin, 0, 0, 0, 1, 0);
}

/**
 * @brief Configure SPI peripheral clock and GPIO pins based on SPI instance
 *
 * Automatically detects which SPI peripheral is configured and enables:
 * - Appropriate clock (APB1 for SPI2/SPI3, APB2 for SPI1)
 * - Required GPIO ports and pins (MISO, MOSI, SCK)
 *
 * Supported configurations for STM32F407:
 * - SPI1: PA5(SCK), PA6(MISO), PA7(MOSI), AF5
 * - SPI2: PB10(SCK), PC2(MISO), PC3(MOSI), AF5
 * - SPI3: PC10(SCK), PC11(MISO), PC12(MOSI), AF6
 *
 * @param spi Pointer to SPI peripheral (SPI1, SPI2, or SPI3)
 */
static void init_spi_gpio_and_clock(SPI_TypeDef *spi) {
  assert(spi != NULL);

#if defined(SPI1)
  if (spi == SPI1) {
    // Enable SPI1 peripheral clock (APB2)
    RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;

    // Enable GPIOA clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

    // Configure PA5(SCK), PA6(MISO), PA7(MOSI) as alternate function AF5
    // Mode: AF(2), Output Type: PushPull(0), Speed: VeryHigh(3), Pull: No(0)
    config_gpio_pin(GPIOA, (1 << 5) | (1 << 6) | (1 << 7), 2, 0, 3, 0, 5);
    return;
  }
#endif

#if defined(SPI2)
  if (spi == SPI2) {
    // Enable SPI2 peripheral clock (APB1)
    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;

    // Enable GPIOB and GPIOC clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

    // Configure PB10(SCK) as alternate function AF5
    config_gpio_pin(GPIOB, (1 << 10), 2, 0, 3, 0, 5);

    // Configure PC2(MISO), PC3(MOSI) as alternate function AF5
    config_gpio_pin(GPIOC, (1 << 2) | (1 << 3), 2, 0, 3, 0, 5);
    return;
  }
#endif

