gibic-leici/ADS1299/Ports/STM32/ads1299lib_STM32F407.c
#if defined(SPI3)
  if (spi == SPI3) {
    // Enable SPI3 peripheral clock (APB1)
    RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;

    // Enable GPIOC clock
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

    // Configure PC10(SCK), PC11(MISO), PC12(MOSI) as alternate function AF6
    config_gpio_pin(GPIOC, (1 << 10) | (1 << 11) | (1 << 12), 2, 0, 3, 0, 6);
    return;
  }
#endif

  // If we reach here, unsupported SPI peripheral
  assert(0);
}

/**
 * @brief Initialize SPI peripheral and conditionally DMA for ADS1299
 * communication
 *
 * Configures SPI Mode 1 (CPOL=0, CPHA=1), 8-bit data width, MSB first,
 * with software NSS management. Automatically enables SPI peripheral clock
 * and configures GPIO pins based on the SPI instance. Clock speed is configured
 * to meet ADS1299's maximum 10 MHz requirement. If SPI_DMA is enabled,
 * initializes DMA streams for RX and TX transfers with proper channel and
 * memory increment settings.
 *
 * @param self Pointer to ads_t structure containing interface handler
 *
 * @note Uses software-managed Chip Select (CS) via GPIO
 * @note DMA channels must be configured in STM32_interface_handler_t
 */
static void init_spi(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  SPI_TypeDef *spi = interface->spi;
  assert(spi != NULL);

  // Configure SPI peripheral clock and GPIO pins
  init_spi_gpio_and_clock(spi);

  // Configure SPI CR1
  // BR: Div2 (000) for safe speed  (18MHZ).
  // ADS1299 max SCLK is 20MHz.
  // APB2 (SPI1) 84MHz / 8 = 10.5MHz.
  // APB1 (SPI2/3) 42MHz / 8 = 5.25MHz.
  // This is safe and reliable.
  // CPOL=0, CPHA=1 (Mode 1).
  // DFF=8bit (0). MSB First (0). SSM=1, SSI=1, MSTR=1.
  spi->CR1 = (0 << 3) |  // BR: Div2
             (0 << 1) |  // CPOL: Low
             (1 << 0) |  // CPHA: 2Edge
             (0 << 11) | // DFF: 8-bit
             (0 << 7) |  // LSBFIRST: MSB First
             (1 << 9) |  // SSM: Enabled
             (1 << 8) |  // SSI: Internal High
             (1 << 2);   // MSTR: Master

  spi->CR1 &= ~(1U << 13); // CRC disable
  spi->CR2 = 0;            // SSOE disabled, TXEIE/RXNEIE disabled

#if SPI_DMA
  // Initialize DMA streams for SPI transfers
  assert(interface->dma != NULL);

  /* DMA controller clock enable */
  if (interface->dma == DMA1) {
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
    /* Select IRQ based on configured RX stream */
    // To match original code structure, we check stream index using
    // (stream_address - base) logic? No, let's just use the stream index
    // provided by the user (simulated) or just assume valid IRQ logic. Original
    // code mapped LL_DMA_STREAM_X to IRQn. Since we removed LL, we need a way
    // to map stream pointer to IRQn if generic. But wait,
    // interface->spi_rx_dma_stream is uint32_t. In LL it was likely the Stream
    // Index (0..7). Let's assume it IS the stream index (0..7).
    uint32_t stream_idx = interface->spi_rx_dma_stream;
    IRQn_Type rx_irq = (IRQn_Type)0;

    switch (stream_idx) {
    case 0:
      rx_irq = DMA1_Stream0_IRQn;
      break;
    case 1:
      rx_irq = DMA1_Stream1_IRQn;
      break;
    case 2:
      rx_irq = DMA1_Stream2_IRQn;
      break;
    case 3:
      rx_irq = DMA1_Stream3_IRQn;
      break;
    case 4:
      rx_irq = DMA1_Stream4_IRQn;
      break;
    case 5:
      rx_irq = DMA1_Stream5_IRQn;
      break;
    case 6:
      rx_irq = DMA1_Stream6_IRQn;
      break;
    case 7:
      rx_irq = DMA1_Stream7_IRQn;
      break;
    }

    if (rx_irq) {
      NVIC_SetPriority(rx_irq,
                       NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
      NVIC_EnableIRQ(rx_irq);
    }
  } else if (interface->dma == DMA2) {
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
    uint32_t stream_idx = interface->spi_rx_dma_stream;
    IRQn_Type rx_irq = (IRQn_Type)0;

    switch (stream_idx) {
    case 0:
      rx_irq = DMA2_Stream0_IRQn;
      break;
    case 1:
      rx_irq = DMA2_Stream1_IRQn;
      break;
    case 2:
      rx_irq = DMA2_Stream2_IRQn;
      break;
    case 3:
      rx_irq = DMA2_Stream3_IRQn;
      break;
    case 4:
      rx_irq = DMA2_Stream4_IRQn;
      break;
    case 5:
      rx_irq = DMA2_Stream5_IRQn;
      break;
    case 6:
      rx_irq = DMA2_Stream6_IRQn;
      break;
    case 7:
      rx_irq = DMA2_Stream7_IRQn;
      break;
    }

    if (rx_irq) {
      NVIC_SetPriority(rx_irq,
                       NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
      NVIC_EnableIRQ(rx_irq);
    }
  }

  DMA_Stream_TypeDef *rx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_rx_dma_stream);
  DMA_Stream_TypeDef *tx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_tx_dma_stream);

  // Disable DMA streams
  rx_stream->CR &= ~DMA_SxCR_EN;
  while (rx_stream->CR & DMA_SxCR_EN)
    ;
  tx_stream->CR &= ~DMA_SxCR_EN;
  while (tx_stream->CR & DMA_SxCR_EN)
    ;

  // Configure RX DMA stream
  // Channel 0 (Bits 25-27 = 000). Priority Low (00).
  // Dir: PeriphToMem (00). Mode: Normal (0).
  // Inc: P=0, M=1.
  // Data: Byte (00).
  rx_stream->CR = (0 << 25) |         // Channel 0
                  (0 << 16) |         // Priority Low
                  (0 << 13) |         // MSIZE Byte
                  (0 << 11) |         // PSIZE Byte
                  (1 << 10) |         // MINC Enable
                  (0 << 9) |          // PINC Disable
                  (0 << 6);           // Dir PeriphToMem
  rx_stream->FCR &= ~DMA_SxFCR_DMDIS; // Direct mode enabled (Fifo disabled)

  // Configure TX DMA stream
  // Channel 0 (Bits 25-27 = 000). Priority Low (00).
  // Dir: MemToPeriph (01). Mode: Normal (0).
  // Inc: P=0, M=0 (No Increment for dummy writes).
  tx_stream->CR = (0 << 25) |         // Channel 0
                  (0 << 16) |         // Priority Low
                  (0 << 13) |         // MSIZE Byte
                  (0 << 11) |         // PSIZE Byte
                  (0 << 10) |         // MINC Disable
                  (0 << 9) |          // PINC Disable
                  (1 << 6);           // Dir MemToPeriph
  tx_stream->FCR &= ~DMA_SxFCR_DMDIS; // Direct mode enabled
#endif                                // SPI_DMA
}

