gibic-leici/ADS1299/Ports/STM32/ads1299lib_STM32F407.c
void init_drdy_interrupt(STM32_interface_handler_t *interface) {
  assert(interface != NULL);

  // Configure EXTI line for DRDY pin (falling edge detection)
  // Map GPIO port/pin to SYSCFG EXTICR so EXTI line is routed correctly.
  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
  {
    uint32_t port_index = ((uint32_t)interface->drdy_port - GPIOA_BASE) / 0x400;
    uint32_t pin_mask = interface->drdy_pin;
    uint32_t pin_index = 0;
    while ((pin_mask > 1) && ((pin_mask & 0x1) == 0)) {
      pin_mask >>= 1;
      pin_index++;
    }
    uint32_t exticr_idx = pin_index >> 2;
    uint32_t exticr_pos = (pin_index & 0x3) * 4;
    uint32_t tmp = SYSCFG->EXTICR[exticr_idx];
    tmp &= ~(0xF << exticr_pos);
    tmp |= ((port_index & 0xF) << exticr_pos);
    SYSCFG->EXTICR[exticr_idx] = tmp;
  }

  // Configure EXTI Line
  // Enable Interrupt Mask (IMR)
  EXTI->IMR |= interface->drdy_EXTI_line;
  // Rising/Falling Edge
  EXTI->RTSR &= ~interface->drdy_EXTI_line; // Disable Rising
  EXTI->FTSR |= interface->drdy_EXTI_line;  // Enable Falling

  // Configure NVIC for DRDY EXTI interrupt
  NVIC_SetPriority(interface->drdy_EXTI_IRQn,
                   NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 0, 0));
  NVIC_EnableIRQ(interface->drdy_EXTI_IRQn);
}

/**
 * @brief Initialize ADS1299 hardware interface
 *
 * Sets up the SPI interface, DMA streams, and synchronization primitives
 * (mutex semaphore) for thread-safe SPI communication.
 *
 * @param self Pointer to ads_t structure
 * @return ads_result_t R_OK if initialization successful
 */
ads_result_t ads_interface_init(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);

  // Create binary semaphore for SPI access synchronization
#if FREERTOS
  if (interface->mutex == NULL)
    interface->mutex = xSemaphoreCreateBinary();

  // Release semaphore for initial access
  xSemaphoreGive(interface->mutex);
#endif // FREERTOS

  // init GPIOS
  init_gpios(interface);

  // init SPI
  init_spi(self);

#if DRDY_IT
  // Init EXTI IRQ for DRDY pin
  init_drdy_interrupt(interface);
#endif // DRDY_IT

  // Enable SPI peripheral
  interface->spi->CR1 |= SPI_CR1_SPE;
  return ADS_R_OK;
}

/**
 * @brief Stop ADC data acquisition and disable interrupts
 *
 * Disables the DRDY external interrupt, sends SDATAC and STOP commands
 * to the ADS1299, and updates the device status.
 *
 * @param self Pointer to ads_t structure
 *
 * @warning Blocks interrupts; ensure proper synchronization
 */
void ads_interface_stop(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

#if DRDY_IT
  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  EXTI->IMR &= ~interface->drdy_EXTI_line;
  NVIC_DisableIRQ(interface->drdy_EXTI_IRQn);
#endif // DRDY_IT
}

/**
 * @brief Start ADC data acquisition and enable interrupts
 *
 * Sends START and RDATAC commands to the ADS1299 and enables
 * the DRDY external interrupt to signal new data availability.
 *
 * @param self Pointer to ads_t structure
 *
 */
void ads_interface_start(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

#if DRDY_IT
  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  EXTI->PR = interface->drdy_EXTI_line; // Clear Pending
  EXTI->IMR |= interface->drdy_EXTI_line;
  NVIC_EnableIRQ(interface->drdy_EXTI_IRQn);
#endif // DRDY_IT
}

/**
 * @brief Wait for SPI bus to be ready for the next operation
 *
 * Polls the SPI status flags to ensure the bus is not busy
 * and the transmit buffer is empty before proceeding.
 */
#define WAIT(spi)                                                              \
  while ((spi->SR & SPI_SR_BSY) || !(spi->SR & SPI_SR_TXE)) {                  \
    ;                                                                          \
  }

/**
 * @brief Transmit data via SPI with byte-level control
 *
 * Thread-safe SPI transmission using binary semaphore for mutual exclusion.
 * Transmits data byte-by-byte with interleaved delays to meet
 * ADS1299 multi-byte command timing requirements (section 9.5.3.1 of
 * datasheet).
 *
 * @param self Pointer to ads_t structure
 * @param buff Pointer to transmit buffer
 * @param len Number of bytes to transmit
 *
 * @note CS pin is controlled: LOW during transmission, HIGH after completion
 * @note Includes 1ms delay between bytes for multi-byte command timing
 */
void ads_interface_spi_tx(ads_t *self, uint8_t *buff, uint16_t len) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);
  assert(buff != NULL);
#if FREERTOS
  xSemaphoreTake(interface->mutex, portMAX_DELAY);
#endif                                                  // FREERTOS
  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low
  for (int j = 0; j < len; j++) {
    WAIT(interface->spi);
    *(__IO uint8_t *)&interface->spi->DR = *(buff + j);
    WAIT(interface->spi);

    volatile uint8_t tmp =
        *(__IO uint8_t *)&interface->spi->DR; // Read to clear RXNE
    (void)tmp;
    interface->delay(1);
    // Delay for multi-byte command timing per ADS1299 datasheet section 9.5.3.1
  }
  interface->cs_port->BSRR = interface->cs_pin; // CS High
#if FREERTOS
  xSemaphoreGive(interface->mutex);
#endif // FREERTOS
}

inline void ads_interface_spi_rx_sample(ads_t *self, uint8_t *buff) {

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;

  int bytes_to_read = self->num_channels * 3 + 3;
#if FREERTOS
  xSemaphoreTake(interface->mutex, portMAX_DELAY);
#endif                                                  // FREERTOS
  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low
  for (int j = 0; j < bytes_to_read; j++) {
    WAIT(interface->spi);
    *(__IO uint8_t *)&interface->spi->DR = 0x00;
    WAIT(interface->spi);

    *(buff + j) = *(__IO uint8_t *)&interface->spi->DR;
  }
  interface->cs_port->BSRR = interface->cs_pin; // CS High
#if FREERTOS
  xSemaphoreGive(interface->mutex);
#endif // FREERTOS
}

/**
 * @brief Receive data via SPI with byte-level control
 *
 * Thread-safe SPI reception using binary semaphore for mutual exclusion.
 * Receives data byte-by-byte by transmitting 0x00 dummy bytes
 * while clocking in the response.
 *
 * @param self Pointer to ads_t structure
 * @param buff Pointer to receive buffer
 * @param len Number of bytes to receive
 *
 * @note CS pin is controlled: LOW during reception, HIGH after completion
 * @note Includes ~7µs NOP delay before CS HIGH to meet tCS timing
 */
void ads_interface_spi_rx(ads_t *self, uint8_t *buff, uint16_t len) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);
  assert(buff != NULL);
#if FREERTOS
  xSemaphoreTake(interface->mutex, portMAX_DELAY);
#endif                                                  // FREERTOS
  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low
  for (int j = 0; j < len; j++) {
    WAIT(interface->spi);
    *(__IO uint8_t *)&interface->spi->DR = 0x00;
    WAIT(interface->spi);

    *(buff + j) = *(__IO uint8_t *)&interface->spi->DR;
  }
  // Wait minimum 4 Tclk (approx 7µs) before raising CS per ADS1299 datasheet
  for (int k = 100; k > 0; k--)
    __NOP();
  interface->cs_port->BSRR = interface->cs_pin; // CS High
#if FREERTOS
  xSemaphoreGive(interface->mutex);
#endif // FREERTOS
}

/**
 * @brief Transmit data via SPI with byte-level control
 *
 * Thread-safe SPI transmission using binary semaphore for mutual exclusion.
 * Transmits data byte-by-byte with interleaved delays to meet
 * ADS1299 multi-byte command timing requirements (section 9.5.3.1 of
 * datasheet).
 *
 * @param self Pointer to ads_t structure
 * @param buff Pointer to transmit buffer
 * @param len Number of bytes to transmit
 *
 * @note CS pin is controlled: LOW during transmission, HIGH after completion
 * @note Includes 1ms delay between bytes for multi-byte command timing
 */
uint8_t ads_interface_read_reg(ads_t *self, ads_regs_enum_t reg) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(interface->delay != NULL);

#if FREERTOS
  xSemaphoreTake(interface->mutex, portMAX_DELAY);
#endif // FREERTOS

