gibic-leici/ADS1299/Ports/STM32/ads1299lib_STM32F407.c
  uint8_t buff[3] = {0};
  buff[0] = ADS_CMD_RREG + (uint8_t)reg;

  volatile uint8_t ret = 0;

  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low
  for (int j = 0; j < 3; j++) {
    WAIT(interface->spi);
    *(__IO uint8_t *)&interface->spi->DR = *(buff + j);
    WAIT(interface->spi);

    ret = *(__IO uint8_t *)&interface->spi->DR;
    interface->delay(1);
    // Delay for multi-byte command timing per ADS1299 datasheet section 9.5.3.1
  }
  interface->cs_port->BSRR = interface->cs_pin; // CS High
#if FREERTOS
  xSemaphoreGive(interface->mutex);
#endif // FREERTOS

  return ret;
}

///////////////////////////////////////////////////////////////////////////////////////////
#if SPI_DMA
uint32_t dummy = 0;

static void dma_clear_tc(DMA_TypeDef *dma, uint32_t stream_idx) {
  if (stream_idx < 4) {
    // LIFCR: Streams 0-3
    // Stream 0: Bit 5 (ZF), 4 (DME), 3 (TE), 2 (HT), 0 (FE)?? No, TC is
    // Transfer Complete. TC Flag positions: Stream 0: Bit 5 Stream 1: Bit 11
    // Stream 2: Bit 21
    // Stream 3: Bit 27
    static const uint8_t shifts[] = {5, 11, 21, 27};
    dma->LIFCR |= (1U << shifts[stream_idx]);
  } else {
    // HIFCR: Streams 4-7
    // Same shifts
    static const uint8_t shifts[] = {5, 11, 21, 27};
    dma->HIFCR |= (1U << shifts[stream_idx - 4]);
  }
}

void ads_spi_rx_DMA_stop_and_prepare(ads_t *self, uint8_t *buff, uint16_t len) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;
  assert(buff != NULL);

  DMA_Stream_TypeDef *rx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_rx_dma_stream);
  DMA_Stream_TypeDef *tx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_tx_dma_stream);

  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low

  rx_stream->CR &= ~DMA_SxCR_EN; // Disable RX
  tx_stream->CR &= ~DMA_SxCR_EN; // Disable TX
  while (rx_stream->CR & DMA_SxCR_EN)
    ;
  while (tx_stream->CR & DMA_SxCR_EN)
    ;

  // Config Addresses
  // RX: Valid Buffer
  rx_stream->PAR = (uint32_t)&interface->spi->DR;
  rx_stream->M0AR = (uint32_t)buff;
  // TX: Dummy
  tx_stream->PAR = (uint32_t)&interface->spi->DR;
  tx_stream->M0AR = (uint32_t)&dummy;

  // Config Length
  rx_stream->NDTR = len;
  tx_stream->NDTR = len;

  // Enable SPI DMA Req
  interface->spi->CR2 |= SPI_CR2_RXDMAEN;
  interface->spi->CR2 |= SPI_CR2_TXDMAEN;

  // Clear DMA TC Flags
  dma_clear_tc(interface->dma, interface->spi_rx_dma_stream);
  dma_clear_tc(interface->dma, interface->spi_tx_dma_stream);

  // Enable TC Interrupt for RX
  rx_stream->CR |= DMA_SxCR_TCIE;
}

void ads_interface_spi_rx_sample_DMA_prepare_next(ads_t *self, uint8_t *buff) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;

  int bytes_to_read = self->num_channels * 3 + 3;
  assert(buff != NULL);

  DMA_Stream_TypeDef *rx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_rx_dma_stream);
  DMA_Stream_TypeDef *tx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_tx_dma_stream);

  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low

  rx_stream->CR &= ~DMA_SxCR_EN; // Disable RX
  tx_stream->CR &= ~DMA_SxCR_EN; // Disable TX
  while (rx_stream->CR & DMA_SxCR_EN)
    ;
  while (tx_stream->CR & DMA_SxCR_EN)
    ;

  // Config Addresses
  rx_stream->PAR = (uint32_t)&interface->spi->DR;
  rx_stream->M0AR = (uint32_t)buff;
  tx_stream->PAR = (uint32_t)&interface->spi->DR;
  tx_stream->M0AR = (uint32_t)&dummy;

  // Config Length
  rx_stream->NDTR = bytes_to_read;
  tx_stream->NDTR = bytes_to_read;

  // Enable SPI DMA Req
  interface->spi->CR2 |= SPI_CR2_RXDMAEN;
  interface->spi->CR2 |= SPI_CR2_TXDMAEN;

  // Clear DMA TC Flags
  dma_clear_tc(interface->dma, interface->spi_rx_dma_stream);
  dma_clear_tc(interface->dma, interface->spi_tx_dma_stream);

  // Enable TC Interrupt for RX
  rx_stream->CR |= DMA_SxCR_TCIE;
}

void ads_interface_spi_rx_sample_DMA(ads_t *self) {
  assert(self != NULL);
  assert(self->interface_Handler != NULL);

  STM32_interface_handler_t *interface =
      (STM32_interface_handler_t *)self->interface_Handler;

  DMA_Stream_TypeDef *rx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_rx_dma_stream);
  DMA_Stream_TypeDef *tx_stream =
      (DMA_Stream_TypeDef *)((uint32_t)interface->dma + 0x10 +
                             0x18 * interface->spi_tx_dma_stream);

  interface->cs_port->BSRR = (interface->cs_pin << 16); // CS Low

  rx_stream->CR |= DMA_SxCR_EN; // Enable RX
  tx_stream->CR |= DMA_SxCR_EN; // Enable TX
}

#endif // SPI_DMA
